HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxEth_bf.h
/** \\brief  Mask for Ifx_ETH_PPS_CONTROL_Bits.PPSCTRL_PPSCMD */
#define IFX_ETH_PPS_CONTROL_PPSCTRL_PPSCMD_MSK (0xf)

/** \\brief  Offset for Ifx_ETH_PPS_CONTROL_Bits.PPSCTRL_PPSCMD */
#define IFX_ETH_PPS_CONTROL_PPSCTRL_PPSCMD_OFF (0)

/** \\brief  Length for Ifx_ETH_PPS_CONTROL_Bits.PPSEN0 */
#define IFX_ETH_PPS_CONTROL_PPSEN0_LEN (1)

/** \\brief  Mask for Ifx_ETH_PPS_CONTROL_Bits.PPSEN0 */
#define IFX_ETH_PPS_CONTROL_PPSEN0_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_PPS_CONTROL_Bits.PPSEN0 */
#define IFX_ETH_PPS_CONTROL_PPSEN0_OFF (4)

/** \\brief  Length for Ifx_ETH_PPS_CONTROL_Bits.TRGTMODSEL0 */
#define IFX_ETH_PPS_CONTROL_TRGTMODSEL0_LEN (2)

/** \\brief  Mask for Ifx_ETH_PPS_CONTROL_Bits.TRGTMODSEL0 */
#define IFX_ETH_PPS_CONTROL_TRGTMODSEL0_MSK (0x3)

/** \\brief  Offset for Ifx_ETH_PPS_CONTROL_Bits.TRGTMODSEL0 */
#define IFX_ETH_PPS_CONTROL_TRGTMODSEL0_OFF (5)

/** \\brief  Length for Ifx_ETH_PPS_CONTROL_Bits.TRGTMODSEL1 */
#define IFX_ETH_PPS_CONTROL_TRGTMODSEL1_LEN (2)

/** \\brief  Mask for Ifx_ETH_PPS_CONTROL_Bits.TRGTMODSEL1 */
#define IFX_ETH_PPS_CONTROL_TRGTMODSEL1_MSK (0x3)

/** \\brief  Offset for Ifx_ETH_PPS_CONTROL_Bits.TRGTMODSEL1 */
#define IFX_ETH_PPS_CONTROL_TRGTMODSEL1_OFF (13)

/** \\brief  Length for Ifx_ETH_PPS_CONTROL_Bits.TRGTMODSEL2 */
#define IFX_ETH_PPS_CONTROL_TRGTMODSEL2_LEN (2)

/** \\brief  Mask for Ifx_ETH_PPS_CONTROL_Bits.TRGTMODSEL2 */
#define IFX_ETH_PPS_CONTROL_TRGTMODSEL2_MSK (0x3)

/** \\brief  Offset for Ifx_ETH_PPS_CONTROL_Bits.TRGTMODSEL2 */
#define IFX_ETH_PPS_CONTROL_TRGTMODSEL2_OFF (21)

/** \\brief  Length for Ifx_ETH_PPS_CONTROL_Bits.TRGTMODSEL3 */
#define IFX_ETH_PPS_CONTROL_TRGTMODSEL3_LEN (2)

/** \\brief  Mask for Ifx_ETH_PPS_CONTROL_Bits.TRGTMODSEL3 */
#define IFX_ETH_PPS_CONTROL_TRGTMODSEL3_MSK (0x3)

/** \\brief  Offset for Ifx_ETH_PPS_CONTROL_Bits.TRGTMODSEL3 */
#define IFX_ETH_PPS_CONTROL_TRGTMODSEL3_OFF (29)

/** \\brief  Length for Ifx_ETH_RECEIVE_DESCRIPTOR_LIST_ADDRESS_Bits.RDESLA */
#define IFX_ETH_RECEIVE_DESCRIPTOR_LIST_ADDRESS_RDESLA_LEN (30)

/** \\brief  Mask for Ifx_ETH_RECEIVE_DESCRIPTOR_LIST_ADDRESS_Bits.RDESLA */
#define IFX_ETH_RECEIVE_DESCRIPTOR_LIST_ADDRESS_RDESLA_MSK (0x3fffffff)

/** \\brief  Offset for Ifx_ETH_RECEIVE_DESCRIPTOR_LIST_ADDRESS_Bits.RDESLA */
#define IFX_ETH_RECEIVE_DESCRIPTOR_LIST_ADDRESS_RDESLA_OFF (2)

/** \\brief  Length for Ifx_ETH_RECEIVE_INTERRUPT_WATCHDOG_TIMER_Bits.RIWT */
#define IFX_ETH_RECEIVE_INTERRUPT_WATCHDOG_TIMER_RIWT_LEN (8)

/** \\brief  Mask for Ifx_ETH_RECEIVE_INTERRUPT_WATCHDOG_TIMER_Bits.RIWT */
#define IFX_ETH_RECEIVE_INTERRUPT_WATCHDOG_TIMER_RIWT_MSK (0xff)

/** \\brief  Offset for Ifx_ETH_RECEIVE_INTERRUPT_WATCHDOG_TIMER_Bits.RIWT */
#define IFX_ETH_RECEIVE_INTERRUPT_WATCHDOG_TIMER_RIWT_OFF (0)

/** \\brief  Length for Ifx_ETH_RECEIVE_POLL_DEMAND_Bits.RPD */
#define IFX_ETH_RECEIVE_POLL_DEMAND_RPD_LEN (32)

/** \\brief  Mask for Ifx_ETH_RECEIVE_POLL_DEMAND_Bits.RPD */
#define IFX_ETH_RECEIVE_POLL_DEMAND_RPD_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_RECEIVE_POLL_DEMAND_Bits.RPD */
#define IFX_ETH_RECEIVE_POLL_DEMAND_RPD_OFF (0)

/** \\brief  Length for Ifx_ETH_REMOTE_WAKE_UP_FRAME_FILTER_Bits.WKUPFRMFTR */
#define IFX_ETH_REMOTE_WAKE_UP_FRAME_FILTER_WKUPFRMFTR_LEN (32)

/** \\brief  Mask for Ifx_ETH_REMOTE_WAKE_UP_FRAME_FILTER_Bits.WKUPFRMFTR */
#define IFX_ETH_REMOTE_WAKE_UP_FRAME_FILTER_WKUPFRMFTR_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_REMOTE_WAKE_UP_FRAME_FILTER_Bits.WKUPFRMFTR */
#define IFX_ETH_REMOTE_WAKE_UP_FRAME_FILTER_WKUPFRMFTR_OFF (0)

/** \\brief  Length for
 * Ifx_ETH_RX_1024TOMAXOCTETS_FRAMES_GOOD_BAD_Bits.RX1024_MAXOCTGB */
#define IFX_ETH_RX_1024TOMAXOCTETS_FRAMES_GOOD_BAD_RX1024_MAXOCTGB_LEN (32)

/** \\brief  Mask for
 * Ifx_ETH_RX_1024TOMAXOCTETS_FRAMES_GOOD_BAD_Bits.RX1024_MAXOCTGB */
#define IFX_ETH_RX_1024TOMAXOCTETS_FRAMES_GOOD_BAD_RX1024_MAXOCTGB_MSK (0xffffffff)

/** \\brief  Offset for
 * Ifx_ETH_RX_1024TOMAXOCTETS_FRAMES_GOOD_BAD_Bits.RX1024_MAXOCTGB */
#define IFX_ETH_RX_1024TOMAXOCTETS_FRAMES_GOOD_BAD_RX1024_MAXOCTGB_OFF (0)

/** \\brief  Length for
 * Ifx_ETH_RX_128TO255OCTETS_FRAMES_GOOD_BAD_Bits.RX128_255OCTGB */
#define IFX_ETH_RX_128TO255OCTETS_FRAMES_GOOD_BAD_RX128_255OCTGB_LEN (32)

/** \\brief  Mask for
 * Ifx_ETH_RX_128TO255OCTETS_FRAMES_GOOD_BAD_Bits.RX128_255OCTGB */
#define IFX_ETH_RX_128TO255OCTETS_FRAMES_GOOD_BAD_RX128_255OCTGB_MSK (0xffffffff)

/** \\brief  Offset for
 * Ifx_ETH_RX_128TO255OCTETS_FRAMES_GOOD_BAD_Bits.RX128_255OCTGB */
#define IFX_ETH_RX_128TO255OCTETS_FRAMES_GOOD_BAD_RX128_255OCTGB_OFF (0)

/** \\brief  Length for
 * Ifx_ETH_RX_256TO511OCTETS_FRAMES_GOOD_BAD_Bits.RX256_511OCTGB */
#define IFX_ETH_RX_256TO511OCTETS_FRAMES_GOOD_BAD_RX256_511OCTGB_LEN (32)

/** \\brief  Mask for
 * Ifx_ETH_RX_256TO511OCTETS_FRAMES_GOOD_BAD_Bits.RX256_511OCTGB */
#define IFX_ETH_RX_256TO511OCTETS_FRAMES_GOOD_BAD_RX256_511OCTGB_MSK (0xffffffff)

/** \\brief  Offset for
 * Ifx_ETH_RX_256TO511OCTETS_FRAMES_GOOD_BAD_Bits.RX256_511OCTGB */
#define IFX_ETH_RX_256TO511OCTETS_FRAMES_GOOD_BAD_RX256_511OCTGB_OFF (0)

/** \\brief  Length for
 * Ifx_ETH_RX_512TO1023OCTETS_FRAMES_GOOD_BAD_Bits.RX512_1023OCTGB */
#define IFX_ETH_RX_512TO1023OCTETS_FRAMES_GOOD_BAD_RX512_1023OCTGB_LEN (32)

/** \\brief  Mask for
 * Ifx_ETH_RX_512TO1023OCTETS_FRAMES_GOOD_BAD_Bits.RX512_1023OCTGB */
#define IFX_ETH_RX_512TO1023OCTETS_FRAMES_GOOD_BAD_RX512_1023OCTGB_MSK (0xffffffff)

/** \\brief  Offset for
 * Ifx_ETH_RX_512TO1023OCTETS_FRAMES_GOOD_BAD_Bits.RX512_1023OCTGB */
#define IFX_ETH_RX_512TO1023OCTETS_FRAMES_GOOD_BAD_RX512_1023OCTGB_OFF (0)

/** \\brief  Length for Ifx_ETH_RX_64OCTETS_FRAMES_GOOD_BAD_Bits.RX64OCTGB */
#define IFX_ETH_RX_64OCTETS_FRAMES_GOOD_BAD_RX64OCTGB_LEN (32)

/** \\brief  Mask for Ifx_ETH_RX_64OCTETS_FRAMES_GOOD_BAD_Bits.RX64OCTGB */
#define IFX_ETH_RX_64OCTETS_FRAMES_GOOD_BAD_RX64OCTGB_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_RX_64OCTETS_FRAMES_GOOD_BAD_Bits.RX64OCTGB */
#define IFX_ETH_RX_64OCTETS_FRAMES_GOOD_BAD_RX64OCTGB_OFF (0)

/** \\brief  Length for
 * Ifx_ETH_RX_65TO127OCTETS_FRAMES_GOOD_BAD_Bits.RX65_127OCTGB */
#define IFX_ETH_RX_65TO127OCTETS_FRAMES_GOOD_BAD_RX65_127OCTGB_LEN (32)

/** \\brief  Mask for
 * Ifx_ETH_RX_65TO127OCTETS_FRAMES_GOOD_BAD_Bits.RX65_127OCTGB */
#define IFX_ETH_RX_65TO127OCTETS_FRAMES_GOOD_BAD_RX65_127OCTGB_MSK (0xffffffff)

