HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxEth_bf.h
/** \\brief  Offset for Ifx_ETH_STATUS_Bits.TPS */
#define IFX_ETH_STATUS_TPS_OFF (1)

/** \\brief  Length for Ifx_ETH_STATUS_Bits.TS */
#define IFX_ETH_STATUS_TS_LEN (3)

/** \\brief  Mask for Ifx_ETH_STATUS_Bits.TS */
#define IFX_ETH_STATUS_TS_MSK (0x7)

/** \\brief  Offset for Ifx_ETH_STATUS_Bits.TS */
#define IFX_ETH_STATUS_TS_OFF (20)

/** \\brief  Length for Ifx_ETH_STATUS_Bits.TTI */
#define IFX_ETH_STATUS_TTI_LEN (1)

/** \\brief  Mask for Ifx_ETH_STATUS_Bits.TTI */
#define IFX_ETH_STATUS_TTI_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_STATUS_Bits.TTI */
#define IFX_ETH_STATUS_TTI_OFF (29)

/** \\brief  Length for Ifx_ETH_STATUS_Bits.TU */
#define IFX_ETH_STATUS_TU_LEN (1)

/** \\brief  Mask for Ifx_ETH_STATUS_Bits.TU */
#define IFX_ETH_STATUS_TU_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_STATUS_Bits.TU */
#define IFX_ETH_STATUS_TU_OFF (2)

/** \\brief  Length for Ifx_ETH_STATUS_Bits.UNF */
#define IFX_ETH_STATUS_UNF_LEN (1)

/** \\brief  Mask for Ifx_ETH_STATUS_Bits.UNF */
#define IFX_ETH_STATUS_UNF_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_STATUS_Bits.UNF */
#define IFX_ETH_STATUS_UNF_OFF (5)

/** \\brief  Length for Ifx_ETH_SUB_SECOND_INCREMENT_Bits.SSINC */
#define IFX_ETH_SUB_SECOND_INCREMENT_SSINC_LEN (8)

/** \\brief  Mask for Ifx_ETH_SUB_SECOND_INCREMENT_Bits.SSINC */
#define IFX_ETH_SUB_SECOND_INCREMENT_SSINC_MSK (0xff)

/** \\brief  Offset for Ifx_ETH_SUB_SECOND_INCREMENT_Bits.SSINC */
#define IFX_ETH_SUB_SECOND_INCREMENT_SSINC_OFF (0)

/** \\brief  Length for Ifx_ETH_SYSTEM_TIME_HIGHER_WORD_SECONDS_Bits.TSHWR */
#define IFX_ETH_SYSTEM_TIME_HIGHER_WORD_SECONDS_TSHWR_LEN (16)

/** \\brief  Mask for Ifx_ETH_SYSTEM_TIME_HIGHER_WORD_SECONDS_Bits.TSHWR */
#define IFX_ETH_SYSTEM_TIME_HIGHER_WORD_SECONDS_TSHWR_MSK (0xffff)

/** \\brief  Offset for Ifx_ETH_SYSTEM_TIME_HIGHER_WORD_SECONDS_Bits.TSHWR */
#define IFX_ETH_SYSTEM_TIME_HIGHER_WORD_SECONDS_TSHWR_OFF (0)

/** \\brief  Length for Ifx_ETH_SYSTEM_TIME_NANOSECONDS_Bits.TSSS */
#define IFX_ETH_SYSTEM_TIME_NANOSECONDS_TSSS_LEN (31)

/** \\brief  Mask for Ifx_ETH_SYSTEM_TIME_NANOSECONDS_Bits.TSSS */
#define IFX_ETH_SYSTEM_TIME_NANOSECONDS_TSSS_MSK (0x7fffffff)

/** \\brief  Offset for Ifx_ETH_SYSTEM_TIME_NANOSECONDS_Bits.TSSS */
#define IFX_ETH_SYSTEM_TIME_NANOSECONDS_TSSS_OFF (0)

/** \\brief  Length for Ifx_ETH_SYSTEM_TIME_NANOSECONDS_UPDATE_Bits.ADDSUB */
#define IFX_ETH_SYSTEM_TIME_NANOSECONDS_UPDATE_ADDSUB_LEN (1)

/** \\brief  Mask for Ifx_ETH_SYSTEM_TIME_NANOSECONDS_UPDATE_Bits.ADDSUB */
#define IFX_ETH_SYSTEM_TIME_NANOSECONDS_UPDATE_ADDSUB_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_SYSTEM_TIME_NANOSECONDS_UPDATE_Bits.ADDSUB */
#define IFX_ETH_SYSTEM_TIME_NANOSECONDS_UPDATE_ADDSUB_OFF (31)

/** \\brief  Length for Ifx_ETH_SYSTEM_TIME_NANOSECONDS_UPDATE_Bits.TSSS */
#define IFX_ETH_SYSTEM_TIME_NANOSECONDS_UPDATE_TSSS_LEN (31)

/** \\brief  Mask for Ifx_ETH_SYSTEM_TIME_NANOSECONDS_UPDATE_Bits.TSSS */
#define IFX_ETH_SYSTEM_TIME_NANOSECONDS_UPDATE_TSSS_MSK (0x7fffffff)

/** \\brief  Offset for Ifx_ETH_SYSTEM_TIME_NANOSECONDS_UPDATE_Bits.TSSS */
#define IFX_ETH_SYSTEM_TIME_NANOSECONDS_UPDATE_TSSS_OFF (0)

/** \\brief  Length for Ifx_ETH_SYSTEM_TIME_SECONDS_Bits.TSS */
#define IFX_ETH_SYSTEM_TIME_SECONDS_TSS_LEN (32)

/** \\brief  Mask for Ifx_ETH_SYSTEM_TIME_SECONDS_Bits.TSS */
#define IFX_ETH_SYSTEM_TIME_SECONDS_TSS_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_SYSTEM_TIME_SECONDS_Bits.TSS */
#define IFX_ETH_SYSTEM_TIME_SECONDS_TSS_OFF (0)

/** \\brief  Length for Ifx_ETH_SYSTEM_TIME_SECONDS_UPDATE_Bits.TSS */
#define IFX_ETH_SYSTEM_TIME_SECONDS_UPDATE_TSS_LEN (32)

/** \\brief  Mask for Ifx_ETH_SYSTEM_TIME_SECONDS_UPDATE_Bits.TSS */
#define IFX_ETH_SYSTEM_TIME_SECONDS_UPDATE_TSS_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_SYSTEM_TIME_SECONDS_UPDATE_Bits.TSS */
#define IFX_ETH_SYSTEM_TIME_SECONDS_UPDATE_TSS_OFF (0)

/** \\brief  Length for Ifx_ETH_TARGET_TIME_NANOSECONDS_Bits.TRGTBUSY */
#define IFX_ETH_TARGET_TIME_NANOSECONDS_TRGTBUSY_LEN (1)

/** \\brief  Mask for Ifx_ETH_TARGET_TIME_NANOSECONDS_Bits.TRGTBUSY */
#define IFX_ETH_TARGET_TIME_NANOSECONDS_TRGTBUSY_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_TARGET_TIME_NANOSECONDS_Bits.TRGTBUSY */
#define IFX_ETH_TARGET_TIME_NANOSECONDS_TRGTBUSY_OFF (31)

/** \\brief  Length for Ifx_ETH_TARGET_TIME_NANOSECONDS_Bits.TTSLO */
#define IFX_ETH_TARGET_TIME_NANOSECONDS_TTSLO_LEN (31)

/** \\brief  Mask for Ifx_ETH_TARGET_TIME_NANOSECONDS_Bits.TTSLO */
#define IFX_ETH_TARGET_TIME_NANOSECONDS_TTSLO_MSK (0x7fffffff)

/** \\brief  Offset for Ifx_ETH_TARGET_TIME_NANOSECONDS_Bits.TTSLO */
#define IFX_ETH_TARGET_TIME_NANOSECONDS_TTSLO_OFF (0)

/** \\brief  Length for Ifx_ETH_TARGET_TIME_SECONDS_Bits.TSTR */
#define IFX_ETH_TARGET_TIME_SECONDS_TSTR_LEN (32)

/** \\brief  Mask for Ifx_ETH_TARGET_TIME_SECONDS_Bits.TSTR */
#define IFX_ETH_TARGET_TIME_SECONDS_TSTR_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_TARGET_TIME_SECONDS_Bits.TSTR */
#define IFX_ETH_TARGET_TIME_SECONDS_TSTR_OFF (0)

/** \\brief  Length for Ifx_ETH_TIMESTAMP_ADDEND_Bits.TSAR */
#define IFX_ETH_TIMESTAMP_ADDEND_TSAR_LEN (32)

/** \\brief  Mask for Ifx_ETH_TIMESTAMP_ADDEND_Bits.TSAR */
#define IFX_ETH_TIMESTAMP_ADDEND_TSAR_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_TIMESTAMP_ADDEND_Bits.TSAR */
#define IFX_ETH_TIMESTAMP_ADDEND_TSAR_OFF (0)

/** \\brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.ATSEN0 */
#define IFX_ETH_TIMESTAMP_CONTROL_ATSEN0_LEN (1)

/** \\brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.ATSEN0 */
#define IFX_ETH_TIMESTAMP_CONTROL_ATSEN0_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.ATSEN0 */
#define IFX_ETH_TIMESTAMP_CONTROL_ATSEN0_OFF (25)

/** \\brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.ATSEN1 */
#define IFX_ETH_TIMESTAMP_CONTROL_ATSEN1_LEN (1)

/** \\brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.ATSEN1 */
#define IFX_ETH_TIMESTAMP_CONTROL_ATSEN1_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_TIMESTAMP_CONTROL_Bits.ATSEN1 */
#define IFX_ETH_TIMESTAMP_CONTROL_ATSEN1_OFF (26)

/** \\brief  Length for Ifx_ETH_TIMESTAMP_CONTROL_Bits.ATSEN2 */
#define IFX_ETH_TIMESTAMP_CONTROL_ATSEN2_LEN (1)

/** \\brief  Mask for Ifx_ETH_TIMESTAMP_CONTROL_Bits.ATSEN2 */
#define IFX_ETH_TIMESTAMP_CONTROL_ATSEN2_MSK (0x1)

