HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxEth_bf.h
/** \\brief  Offset for
 * Ifx_ETH_TX_MULTIPLE_COLLISION_GOOD_FRAMES_Bits.TXMULTCOLG */
#define IFX_ETH_TX_MULTIPLE_COLLISION_GOOD_FRAMES_TXMULTCOLG_OFF (0)

/** \\brief  Length for Ifx_ETH_TX_OCTET_COUNT_GOOD_BAD_Bits.TXOCTGB */
#define IFX_ETH_TX_OCTET_COUNT_GOOD_BAD_TXOCTGB_LEN (32)

/** \\brief  Mask for Ifx_ETH_TX_OCTET_COUNT_GOOD_BAD_Bits.TXOCTGB */
#define IFX_ETH_TX_OCTET_COUNT_GOOD_BAD_TXOCTGB_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_TX_OCTET_COUNT_GOOD_BAD_Bits.TXOCTGB */
#define IFX_ETH_TX_OCTET_COUNT_GOOD_BAD_TXOCTGB_OFF (0)

/** \\brief  Length for Ifx_ETH_TX_OCTET_COUNT_GOOD_Bits.TXOCTG */
#define IFX_ETH_TX_OCTET_COUNT_GOOD_TXOCTG_LEN (32)

/** \\brief  Mask for Ifx_ETH_TX_OCTET_COUNT_GOOD_Bits.TXOCTG */
#define IFX_ETH_TX_OCTET_COUNT_GOOD_TXOCTG_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_TX_OCTET_COUNT_GOOD_Bits.TXOCTG */
#define IFX_ETH_TX_OCTET_COUNT_GOOD_TXOCTG_OFF (0)

/** \\brief  Length for Ifx_ETH_TX_OSIZE_FRAMES_GOOD_Bits.TXOSIZG */
#define IFX_ETH_TX_OSIZE_FRAMES_GOOD_TXOSIZG_LEN (32)

/** \\brief  Mask for Ifx_ETH_TX_OSIZE_FRAMES_GOOD_Bits.TXOSIZG */
#define IFX_ETH_TX_OSIZE_FRAMES_GOOD_TXOSIZG_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_TX_OSIZE_FRAMES_GOOD_Bits.TXOSIZG */
#define IFX_ETH_TX_OSIZE_FRAMES_GOOD_TXOSIZG_OFF (0)

/** \\brief  Length for Ifx_ETH_TX_PAUSE_FRAMES_Bits.TXPAUSE */
#define IFX_ETH_TX_PAUSE_FRAMES_TXPAUSE_LEN (32)

/** \\brief  Mask for Ifx_ETH_TX_PAUSE_FRAMES_Bits.TXPAUSE */
#define IFX_ETH_TX_PAUSE_FRAMES_TXPAUSE_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_TX_PAUSE_FRAMES_Bits.TXPAUSE */
#define IFX_ETH_TX_PAUSE_FRAMES_TXPAUSE_OFF (0)

/** \\brief  Length for Ifx_ETH_TX_SINGLE_COLLISION_GOOD_FRAMES_Bits.TXSNGLCOLG */
#define IFX_ETH_TX_SINGLE_COLLISION_GOOD_FRAMES_TXSNGLCOLG_LEN (32)

/** \\brief  Mask for Ifx_ETH_TX_SINGLE_COLLISION_GOOD_FRAMES_Bits.TXSNGLCOLG */
#define IFX_ETH_TX_SINGLE_COLLISION_GOOD_FRAMES_TXSNGLCOLG_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_TX_SINGLE_COLLISION_GOOD_FRAMES_Bits.TXSNGLCOLG */
#define IFX_ETH_TX_SINGLE_COLLISION_GOOD_FRAMES_TXSNGLCOLG_OFF (0)

/** \\brief  Length for Ifx_ETH_TX_UNDERFLOW_ERROR_FRAMES_Bits.TXUNDRFLW */
#define IFX_ETH_TX_UNDERFLOW_ERROR_FRAMES_TXUNDRFLW_LEN (32)

/** \\brief  Mask for Ifx_ETH_TX_UNDERFLOW_ERROR_FRAMES_Bits.TXUNDRFLW */
#define IFX_ETH_TX_UNDERFLOW_ERROR_FRAMES_TXUNDRFLW_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_TX_UNDERFLOW_ERROR_FRAMES_Bits.TXUNDRFLW */
#define IFX_ETH_TX_UNDERFLOW_ERROR_FRAMES_TXUNDRFLW_OFF (0)

/** \\brief  Length for Ifx_ETH_TX_UNICAST_FRAMES_GOOD_BAD_Bits.TXUCASTGB */
#define IFX_ETH_TX_UNICAST_FRAMES_GOOD_BAD_TXUCASTGB_LEN (32)

/** \\brief  Mask for Ifx_ETH_TX_UNICAST_FRAMES_GOOD_BAD_Bits.TXUCASTGB */
#define IFX_ETH_TX_UNICAST_FRAMES_GOOD_BAD_TXUCASTGB_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_TX_UNICAST_FRAMES_GOOD_BAD_Bits.TXUCASTGB */
#define IFX_ETH_TX_UNICAST_FRAMES_GOOD_BAD_TXUCASTGB_OFF (0)

/** \\brief  Length for Ifx_ETH_TX_VLAN_FRAMES_GOOD_Bits.TXVLANG */
#define IFX_ETH_TX_VLAN_FRAMES_GOOD_TXVLANG_LEN (32)

/** \\brief  Mask for Ifx_ETH_TX_VLAN_FRAMES_GOOD_Bits.TXVLANG */
#define IFX_ETH_TX_VLAN_FRAMES_GOOD_TXVLANG_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_TX_VLAN_FRAMES_GOOD_Bits.TXVLANG */
#define IFX_ETH_TX_VLAN_FRAMES_GOOD_TXVLANG_OFF (0)

/** \\brief  Length for Ifx_ETH_VERSION_Bits.SNPSVER */
#define IFX_ETH_VERSION_SNPSVER_LEN (8)

/** \\brief  Mask for Ifx_ETH_VERSION_Bits.SNPSVER */
#define IFX_ETH_VERSION_SNPSVER_MSK (0xff)

/** \\brief  Offset for Ifx_ETH_VERSION_Bits.SNPSVER */
#define IFX_ETH_VERSION_SNPSVER_OFF (0)

/** \\brief  Length for Ifx_ETH_VERSION_Bits.USERVER */
#define IFX_ETH_VERSION_USERVER_LEN (8)

/** \\brief  Mask for Ifx_ETH_VERSION_Bits.USERVER */
#define IFX_ETH_VERSION_USERVER_MSK (0xff)

/** \\brief  Offset for Ifx_ETH_VERSION_Bits.USERVER */
#define IFX_ETH_VERSION_USERVER_OFF (8)

/** \\brief  Length for Ifx_ETH_VLAN_TAG_Bits.ESVL */
#define IFX_ETH_VLAN_TAG_ESVL_LEN (1)

/** \\brief  Mask for Ifx_ETH_VLAN_TAG_Bits.ESVL */
#define IFX_ETH_VLAN_TAG_ESVL_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_VLAN_TAG_Bits.ESVL */
#define IFX_ETH_VLAN_TAG_ESVL_OFF (18)

/** \\brief  Length for Ifx_ETH_VLAN_TAG_Bits.ETV */
#define IFX_ETH_VLAN_TAG_ETV_LEN (1)

/** \\brief  Mask for Ifx_ETH_VLAN_TAG_Bits.ETV */
#define IFX_ETH_VLAN_TAG_ETV_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_VLAN_TAG_Bits.ETV */
#define IFX_ETH_VLAN_TAG_ETV_OFF (16)

/** \\brief  Length for Ifx_ETH_VLAN_TAG_Bits.VL */
#define IFX_ETH_VLAN_TAG_VL_LEN (16)

/** \\brief  Mask for Ifx_ETH_VLAN_TAG_Bits.VL */
#define IFX_ETH_VLAN_TAG_VL_MSK (0xffff)

/** \\brief  Offset for Ifx_ETH_VLAN_TAG_Bits.VL */
#define IFX_ETH_VLAN_TAG_VL_OFF (0)

/** \\brief  Length for Ifx_ETH_VLAN_TAG_Bits.VTHM */
#define IFX_ETH_VLAN_TAG_VTHM_LEN (1)

/** \\brief  Mask for Ifx_ETH_VLAN_TAG_Bits.VTHM */
#define IFX_ETH_VLAN_TAG_VTHM_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_VLAN_TAG_Bits.VTHM */
#define IFX_ETH_VLAN_TAG_VTHM_OFF (19)

/** \\brief  Length for Ifx_ETH_VLAN_TAG_Bits.VTIM */
#define IFX_ETH_VLAN_TAG_VTIM_LEN (1)

/** \\brief  Mask for Ifx_ETH_VLAN_TAG_Bits.VTIM */
#define IFX_ETH_VLAN_TAG_VTIM_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_VLAN_TAG_Bits.VTIM */
#define IFX_ETH_VLAN_TAG_VTIM_OFF (17)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXETH_BF_H */
